In [4]:
import pandas as pd

In [5]:
names = pd.Series(['andrew','bobo','claire','david','4'])
names

0    andrew
1      bobo
2    claire
3     david
4         4
dtype: object

In [6]:
names.str.capitalize()

0    Andrew
1      Bobo
2    Claire
3     David
4         4
dtype: object

In [7]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [9]:
tech_finance = ['GOOG,APPL,AMZN','JPM,BAC,GS']
tech_finance

['GOOG,APPL,AMZN', 'JPM,BAC,GS']

In [10]:
len(tech_finance)

2

In [11]:
names = pd.Series(tech_finance)

In [12]:
names

0    GOOG,APPL,AMZN
1        JPM,BAC,GS
dtype: object

In [16]:
names.str.split(",")

0    [GOOG, APPL, AMZN]
1        [JPM, BAC, GS]
dtype: object

In [18]:
names.str.split(",").str[0]

0    GOOG
1     JPM
dtype: object

In [21]:
names.str.split(",", expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1   JPM   BAC    GS

In [44]:
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])
messy_names

0      andrew
1         bo;bo
2      claire
dtype: object

In [28]:
messy_names.str.replace(";","")

0      andrew
1          bobo
2      claire
dtype: object

In [26]:
messy_names.str.strip()

0    andrew
1     bo;bo
2    claire
dtype: object

In [29]:
messy_names.str.replace(";","").str.strip()

0    andrew
1      bobo
2    claire
dtype: object

In [31]:
messy_names.str.replace(";","").str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

In [51]:
def cleanup(x):
    x = x.replace(";","")
    x = x.strip()
    x = x.capitalize()
    return x

In [52]:
messy_names.apply(cleanup)

0    Andrew
1      Bobo
2    Claire
dtype: object

In [55]:
import timeit
# code snippet to be executed only once
setup = '''
import pandas as pd
import numpy as np
messy_names = pd.Series(["andrew  ","bo;bo","  claire  "])
def cleanup(name):
    name = name.replace(";","")
    name = name.strip()
    name = name.capitalize()
    return name
'''
# code snippet whose execution time is to be measured
stmt_pandas_str = '''
messy_names.str.replace(";","").str.strip().str.capitalize()
'''
stmt_pandas_apply = '''
messy_names.apply(cleanup)
'''

In [56]:
timeit.timeit(setup = setup,
                    stmt = stmt_pandas_str,
                    number = 10000)

4.406610799999953

In [57]:
timeit.timeit(setup = setup,
                    stmt = stmt_pandas_apply,
                    number = 10000)

1.3636708000001363

In [58]:
from datetime import datetime

In [59]:
# To illustrate the order of arguments
my_year = 2017
my_month = 1
my_day = 2
my_hour = 13
my_minute = 30
my_second = 15

In [61]:
my_date = datetime(my_year,my_month,my_day)
my_date

datetime.datetime(2017, 1, 2, 0, 0)

In [62]:
my_date_time = datetime(my_year,my_month,my_day,my_hour,my_minute,my_second)
my_date_time

datetime.datetime(2017, 1, 2, 13, 30, 15)

In [64]:
myser = pd.Series(['Nov 3, 2000', '2000-01-01', None])
myser

0    Nov 3, 2000
1     2000-01-01
2           None
dtype: object

In [72]:
myser = pd.to_datetime(myser)
myser

0   2000-11-03
1   2000-01-01
2          NaT
dtype: datetime64[ns]

In [73]:
myser[0].day

3

In [74]:
euro_date = '10-12-2000'

In [75]:
pd.to_datetime(euro_date)

Timestamp('2000-10-12 00:00:00')

In [76]:
pd.to_datetime(euro_date, dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [78]:
df = pd.read_csv("example.csv")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [80]:
df = pd.read_csv("example.csv", index_col = 0)
df

     b   c   d
a
0    1   2   3
4    5   6   7
8    9  10  11
12  13  14  15

In [81]:
df.to_csv("new.csv", index=False)

In [84]:
tables = pd.read_html("https://en.wikipedia.org/wiki/World_population")
tables[0]

        World population (millions, UN estimates)[14]  \
                                                    #
0                                                   1
1                                                   2
2                                                   3
3                                                   4
4                                                   5
5                                                   6
6                                                   7
7                                                   8
8                                                   9
9                                                  10
10                                                NaN
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                      Top ten most populous countries
0                                            China[B]
1                                               India
2                                       United States
3                                           Indonesia
4                                            Pakistan
5                                              Brazil
6                                             Nigeria
7                                          Bangladesh
8                                              Russia
9                                              Mexico
10                                        World total
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2000
0                                                1270
1                                                1053
2                                                 283
3                                                 212
4                                                 136
5                                                 176
6                                                 123
7                                                 131
8                                                 146
9                                                 103
10                                               6127
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2015
0                                                1376
1                                                1311
2                                                 322
3                                                 258
4                                                 208
5                                                 206
6                                                 182
7                                                 161
8                                                 146
9                                                 127
10                                               7349
11  Notes: .mw-parser-output .reflist{font-size:90...


                                              2030[A]
0                                                1416
1                                                1528
2                                                 356
3                                                 295
4                                                 245
5                                                 228
6                                                 263
7                                                 186
8                                                 149
9                                                 148
10                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...

In [85]:
tables[1]

,Continent,Density(inhabitants/km2),Population(millions),Most populous country,Most populous city (metropolitan area)
0,Asia,104.1,4641,"1,439,323,000[note 1] – China","37,393,000/13,929,000 – Greater Tokyo Area/Tok..."
1,Africa,44.4,1340,"0206,139,000 – Nigeria","20,900,000 – Cairo[17]"
2,Europe,73.4,747,"0145,934,000 – Russia;approx. 110 million in E...","16,855,000/12,537,000 – Moscow metropolitan ar..."
3,Latin America,24.1,653,"0212,559,000 – Brazil","22,043,000/12,176,000 – São Paulo Metro Area/S..."
4,Northern America[note 2],14.9,368,"0331,002,000 – United States","23,724,000/8,323,000 – New York metropolitan a..."
5,Oceania,5,42,"0025,499,000 – Australia","4,925,000 – Sydney"
6,Antarctica,~0,0.004[16],N/A[note 3],"1,258 – McMurdo Station"

In [86]:
world_pop = tables[0]

In [87]:
world_pop.columns

MultiIndex([('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...)],
           )

In [89]:
world_pop = world_pop["World population (millions, UN estimates)[14]"].drop("#", axis = 1)

In [90]:
world_pop

,Top ten most populous countries,2000,2015,2030[A]
0,China[B],1270,1376,1416
1,India,1053,1311,1528
2,United States,283,322,356
3,Indonesia,212,258,295
4,Pakistan,136,208,245
5,Brazil,176,206,228
6,Nigeria,123,182,263
7,Bangladesh,131,161,186
8,Russia,146,146,149
9,Mexico,103,127,148
10,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [91]:
world_pop.columns = ["Countries", "2000", "2015", "2030"]
world_pop

,Countries,2000,2015,2030
0,China[B],1270,1376,1416
1,India,1053,1311,1528
2,United States,283,322,356
3,Indonesia,212,258,295
4,Pakistan,136,208,245
5,Brazil,176,206,228
6,Nigeria,123,182,263
7,Bangladesh,131,161,186
8,Russia,146,146,149
9,Mexico,103,127,148
10,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [92]:
world_pop = world_pop.drop(11,axis=0)
world_pop

        Countries  2000  2015  2030
0        China[B]  1270  1376  1416
1           India  1053  1311  1528
2   United States   283   322   356
3       Indonesia   212   258   295
4        Pakistan   136   208   245
5          Brazil   176   206   228
6         Nigeria   123   182   263
7      Bangladesh   131   161   186
8          Russia   146   146   149
9          Mexico   103   127   148
10    World total  6127  7349  8501

In [95]:
df.to_html("world_pop.html", index=False)

In [98]:
df=pd.read_excel("my_excel_file.xlsx", sheet_name="First_Sheet")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [99]:
pd.ExcelFile("my_excel_file.xlsx").sheet_names

['First_Sheet']

In [100]:
excel_sheets = pd.read_excel("my_excel_file.xlsx", sheet_name=None)
excel_sheets

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [101]:
type(excel_sheets)

dict

In [103]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\nio\anaconda3\lib\site-packages (1.3.18)
Note: you may need to restart the kernel to use updated packages.

In [104]:
from sqlalchemy import create_engine

In [105]:
temp_db = create_engine("sqlite:///:memory:")

In [106]:
world_pop

        Countries  2000  2015  2030
0        China[B]  1270  1376  1416
1           India  1053  1311  1528
2   United States   283   322   356
3       Indonesia   212   258   295
4        Pakistan   136   208   245
5          Brazil   176   206   228
6         Nigeria   123   182   263
7      Bangladesh   131   161   186
8          Russia   146   146   149
9          Mexico   103   127   148
10    World total  6127  7349  8501

In [108]:
world_pop.to_sql(name="populations", con=temp_db)

In [109]:
pd.read_sql(sql="populations", con=temp_db)

    index      Countries  2000  2015  2030
0       0       China[B]  1270  1376  1416
1       1          India  1053  1311  1528
2       2  United States   283   322   356
3       3      Indonesia   212   258   295
4       4       Pakistan   136   208   245
5       5         Brazil   176   206   228
6       6        Nigeria   123   182   263
7       7     Bangladesh   131   161   186
8       8         Russia   146   146   149
9       9         Mexico   103   127   148
10     10    World total  6127  7349  8501

In [110]:
pd.read_sql_query(sql="SELECT Countries FROM populations",con=temp_db)

        Countries
0        China[B]
1           India
2   United States
3       Indonesia
4        Pakistan
5          Brazil
6         Nigeria
7      Bangladesh
8          Russia
9          Mexico
10    World total